{"authorDailyContributionsMap":{"NCF3535":[{"date":"2024-08-19","commitResults":[{"hash":"b9892710056a7dec141b9045771da544029c34fd","isMergeCommit":false,"messageTitle":"Rename Duke to Aether and implement basic greeting and exit","messageBody":"","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":17,"deletions":10}}}]},{"date":"2024-08-28","commitResults":[{"hash":"fbef39a5c98ad9c6604fdc71828f77007b6295c8","isMergeCommit":false,"messageTitle":"Implement Level-1: Echo functionality in Aether","messageBody":"Aether currently outputs static content and lacks interactivity\n\nRefactor Aether to introduce a command loop that handles user input, echoing commands back and exiting on \"exit\" as required by Level-1\n\nTransition the codebase to an object-oriented design, separating the logic into the Aether and Display classes to improve code organization and allow for future enhancements\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":57,"deletions":6}}},{"hash":"f59a734c4640562068ae74667aa7c65d3a0de240","isMergeCommit":false,"messageTitle":"Add task storage and listing functionality to Aether","messageBody":"Aether previously only echoed user input and exited on \"exit,\" without\nstoring any user commands\n\nThe lack of task storage and listing limited the chatbot\u0027s usefulness\nas it couldn\u0027t track or manage user tasks\n\nChanges made:\n* Store user commands as tasks in a fixed-size array, allowing them to\n  be listed later\n* Introduce a \"list\" command to display all stored tasks with their\n  indices\n* Update the program to exit on \"bye\" instead of \"exit\" to make it feel\n  more conversational and natural for users\n* Refactor output handling into the Display class to separate concerns\n  and maintain clean code\n\nThese changes improve the utility of Aether by enabling task management\nand making interactions more intuitive and user-friendly\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":29,"deletions":3}}},{"hash":"60518cf41f25ddd1578af7b214919d1f884dd3ff","isMergeCommit":false,"messageTitle":"Implement marking and unmarking tasks in Aether","messageBody":"Aether currently allows adding and listing tasks, but lacks the\nability to mark tasks as done or revert them to not done.\n\nMarking tasks and umarking as done is crucial for tracking task completion.\n\nImplement functionality to:\n*Mark tasks as done, visually indicated by a ✓.\n*Unmark tasks, reverting their status to not done.\n\nThese changes enhance Aether\u0027s task management capabilities,\nallowing users to accurately track their tasks.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":52,"deletions":6}}},{"hash":"3babaa6105abc3a6727a6c032dd82fd3601a1bd9","isMergeCommit":false,"messageTitle":"Align code with Java coding standards","messageBody":"The code was not fully compliant with the Java coding standards, impacting readability\n\nThis commit makes the following adjustments:\n*Added inline comments for key code segments to clarify their\n  purpose and logic.\n*Improved code formatting, including indentation and line wrapping\n\nThese changes will help enhance the readability of the code, making it easier to add new features to it in the future\n","tags":["A-CodingStandard"],"fileTypesAndContributionMap":{"java":{"insertions":9,"deletions":6}}}]}]},"authorFileTypeContributionMap":{"NCF3535":{"java":143,"md":0,"fxml":0,"sh":0,"bat":0,"gradle":0,"txt":0}},"authorContributionVariance":{"NCF3535":2002.1538},"authorDisplayNameMap":{"NCF3535":"NG C..FONG"}}
